src/cf/Documents/Заметки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Заметки</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Хэштеги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Хэштег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Хэштеги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonForms/ФормаНачальногоОтображения/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолучитьСлучайнуюЗаметку();
КонецПроцедуры

&НаСервере
Процедура ПолучитьСлучайнуюЗаметку()

	СписокЗаметок  = ПолучитьСписокДокументовЗаметка();
	Генератор = Новый ГенераторСлучайныхЧисел(0);
	СлучайныйНомерДокумента = Генератор.СлучайноеЧисло(0,СписокЗаметок.Количество()-1);

	ЭтаФорма.Заголовок = СписокЗаметок[СлучайныйНомерДокумента].Заголовок;
	
	Заметка = СписокЗаметок[СлучайныйНомерДокумента].Хранилище.Получить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокДокументовЗаметка()
	
	МассивДокументов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заметки.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Заметки КАК Заметки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивДокументов.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
Возврат МассивДокументов;

КонецФункции // ()
